"""

MADE BY Usanin Andrey a.k.a. Aqamaru
         TG: @NightsForever          
            VK: @Aqamaru            

"""

from enum import Enum, EnumType

class Text(str, Enum):
    GREETINGS = ("Здравствуйте!\n"
                 "Это бот-калькулятор.")
        
    WHICH_CONVERT_FROM = ("Какую величину вы хотите перевести?")

    WHICH_CONVERT_TO = ("Какую величину вы хотите получить?")
    
    CONVERT_MEANINGS = ("ν - Частота волны\n"
                        "λ - Длина волны\n"
                        "E(ф) - Энергия фотона")
    
    CONVERT_ENTER = ("Введите значение для %q:\n"
                     "Поддерживается ввод чисел в виде x*10^n\n"
                     "Приставки Си не поддерживаются")
    
    CONVERT_ENTER_VELOCITY = ("Введите значение скорости распространения волны в среде:\n"
                              "Поддерживается ввод чисел в виде x*10^n")
    
    # %m - буквенное обозначение
    # %v - числовое значение + единицы измерения
    RESULT = ("Результат: %m = %v")

    WHICH_CALCULATE = ("Какую величину вы хотите вычислить?")
    
    CALCULATE_MEANINGS = ("Ф(е) - флюенс лазера\n"
                          "X(рез.) - положение резонанса на полувысоте")

    CALCULATE_WHICH_PROFILE = ("Выберите профиль луча, для которого будут производиться расчёты:")
    
    CALCULATE_ENTER_POWER = ("Введите среднюю мощность лазера в Дж:\n"
                             "Поддерживается ввод чисел в виде x*10^n")

    CALCULATE_ENTER_FREQ = ("Введите частоту лазера в Гц:\n"
                            "Поддерживается ввод чисел в виже x*10^n")

    CALCULATE_ENTER_DIAMETER = ("Введите диаметр луча лазера в см:\n"
                                "Поддерживается ввод чисел в виде x*10^n") 

    CALCULATE_ENTER_SPECTER = ("Отправьте файл в формате .txt, содержащий спектр:\n"
                               "P.S. - Не добавляйте подпись для файла")

    WHICH_SCALE_FROM = ("Какая приставка Си у вас есть?")

    WHICH_SCALE_TO = ("Какую приставку Си хотите получить?")
    
    SCALE_GET_NUM = ("Введите числовое значение:\n"
                     "Поддерживается ввод чисел в виде x*10^n")

    SCALE_FINAL = ("Результат: %n %pЕд.")

    HELP = ("Выберите раздел для получения информации о нём:")
    
    HELP_CONVERT = ("В этом разделе вы сможете переводить частоту излучения, длину волны, энергию фотона между собой")

    HELP_CALCULATE = ("В этом разделе вы сможете вычислить положение резонанса на полувысоте по спектру и вычислить флюенс лазерной системы")

    HELP_SCALING = ("В этом разделе вы сможете переводить между собой приставки Си и получать значения в стандартизированном виде")

    SURVEY = ("Оцените опыт использования калькулятора(от 1 до 10):")
    
    SURVEY_IDEAS = ("Каких функций в калькуляторе вам не хватает?")

    SURVEY_END = ("Спасибо за участие в опросе!")

    SURVEY_ALREADY = ("Ваши ответы уже были сохранены!")
    
    SURVEY_MARK = ("Ваша оценка выходит за пределы от 1 до 10, попробуйте ещё раз.")

    UNKNOWN_COMMAND = ("Неизвестная команда.\n"
                       "Проверьте корректность ввода.")


class Button(str, Enum):
    CONVERT = ("Перевод")
    
    MEANINGS = ("Обозначения")

    CALCULATE = ("Вычисление")

    SCALING = ("Масштабирование")

    HELP = ("Помощь")
    
    SURVEY = ("Опрос")

    BACK = ("Назад")

    BACK_TO_MAIN_MENU = ("Вернуться в меню")

class Quantities(str, Enum):
    FLUENCE = ("Ф(е)")
    RESONANCESPOT = ("X(рез.)")
    WAVEIFREQUENCY = ("ν")
    WAVEILENGHT = ("λ")
    PHOTONIENERGY = ("E(ф)")

class Scale(str, Enum):
    DECA = ("да")
    HECTO = ("г")
    KILO = ("к")
    MEGA = ("М")
    GIGA = ("Г")
    TERA = ("Т")
    PETA = ("П")
    EXA = ("Э")
    ZETTA = ("З")
    YOTTA = ("И")
    RONNA = ("Рн")
    QUETTA = ("Кв")
    
    DECI = ("д")
    CENTI = ("с")
    MILI = ("м")
    MICRO = ("мк")
    NANO = ("н")
    PICO = ("п")
    FEMTO = ("ф")
    ATTO = ("а")
    ZEPTO = ("з")
    YOCTO = ("и")
    RONTO = ("рн")
    QUECTO = ("кв")

class Profiles(str, Enum):
    GAUSIAN = ("Гаусовский")
    FLATTOP = ("Плоский")
